//--------------------------------------------------------------------------------
// 
// 列挙型を便利に使う用 [enum.h]
// Author: Taito Jin
// 
//--------------------------------------------------------------------------------
#pragma once

//===================================================
// 列挙型の名前空間
//===================================================
namespace Enum
{
	template<typename T, typename U = std::underlying_type_t<T>>
	constexpr U from(T t) { return static_cast<U>(t); }

} // namespace Enum
