//--------------------------------------------------------------------------------
// 
// 外部ファイルの操作 [file.h]
// Author: Taito Jin
// 
//--------------------------------------------------------------------------------
#pragma once

//===================================================
// 外部ファイルの操作の名前空間 (json)
//===================================================
namespace File::Json
{
	//---------------------------------------------------
	// プロトタイプ宣言
	//---------------------------------------------------
	json load(const std::string& inFilename);						// 読み込み
	bool save(const std::string& inFilename, const json& inJson);	// 書き出し
	json loadAndPerformValidator(const std::string& inFilename);	// 読み込んで検証する
}

//===================================================
// 外部ファイルの操作の名前空間 (ini)
//===================================================
namespace File::Ini
{
	//---------------------------------------------------
	// プロトタイプ宣言
	//---------------------------------------------------
	ini::IniFile load(const std::string& inFilename);						// 読み込み
	bool save(const std::string& inFilename, const ini::IniFile& inIni);	// 書き出し
}
