//--------------------------------------------------------------------------------
// 
// ランダムな値を生成する [random_generator.cpp]
// Author: Taito Jin
// 
//--------------------------------------------------------------------------------

//---------------------------------------------------
// インクルード
//---------------------------------------------------
// utility
#include "utility/random_generator.h"

//---------------------------------------------------
// 静的メンバの初期化
//---------------------------------------------------
std::random_device RandomGenerator::m_randomDevice;								// 乱数生成エンジン
std::mt19937 RandomGenerator::m_generator(RandomGenerator::m_randomDevice());	// メルセンヌ・ツイスタを使用
