//--------------------------------------------------------------------------------
// 
// ブロックの基底クラス [block_base.cpp]
// Author: Taito Jin
// 
//--------------------------------------------------------------------------------

//---------------------------------------------------
// インクルード
//---------------------------------------------------
// game_object
// // 3d
// // // block
#include "game_object/3d/block/block_base.h"

//---------------------------------------------------
// コンストラクタ
//---------------------------------------------------
BlockBase::BlockBase()
	: Model()
{
	// DO_NOTHING
}

//---------------------------------------------------
// ムーブコンストラクタ
//---------------------------------------------------
BlockBase::BlockBase(BlockBase&& right) noexcept
	: Model(std::move(right))
{
	// DO_NOTHING
}

//---------------------------------------------------
// 初期設定
//---------------------------------------------------
HRESULT BlockBase::init(const json& inParam)
{
	// 親クラスの処理
	HRESULT hr = Model::init(inParam);
	if (FAILED(hr))
	{
		return E_FAIL;
	}

	return S_OK;
}

//---------------------------------------------------
// 終了処理
//---------------------------------------------------
void BlockBase::uninit()
{
	// 親クラスの処理
	Model::uninit();
}

//---------------------------------------------------
// 更新処理
//---------------------------------------------------
void BlockBase::update()
{
	// 親クラスの処理
	Model::update();
}

//---------------------------------------------------
// 描画処理
//---------------------------------------------------
void BlockBase::draw() const
{
	// 親クラスの処理
	Model::draw();
}

//---------------------------------------------------
// インスペクター
//---------------------------------------------------
void BlockBase::inspector()
{
	// 親クラスの処理
	Model::inspector();
}

//---------------------------------------------------
// 保存
//---------------------------------------------------
void BlockBase::save(json& outObject) const
{
	// 親クラスの処理
	Model::save(outObject);
}

//---------------------------------------------------
// ムーブ代入演算子
//---------------------------------------------------
BlockBase& BlockBase::operator=(BlockBase&& right) noexcept
{
	if (this != &right)
	{
		// 親クラスの処理
		Model::operator=(std::move(right));
	}

	return *this;
}
