//--------------------------------------------------------------------------------
// 
// 雪 [snow_2d.cpp]
// Author: Taito Jin
// 
//--------------------------------------------------------------------------------

//---------------------------------------------------
// インクルード
//---------------------------------------------------
// game_object
// // 2d
#include "game_object/2d/snow_2d.h"
// game_manager
#include "game_manager/game_manager.h"

//---------------------------------------------------
// コンストラクタ
//---------------------------------------------------
Snow2D::Snow2D()
	: GameObject2D()
	, m_move(DEF_VEC3)
{
	// DO_NOTHING
}

//---------------------------------------------------
// 初期設定
//---------------------------------------------------
HRESULT Snow2D::init(const json& inParam)
{
	// 親クラスの処理
	HRESULT hr = GameObject2D::init(inParam);
	if (FAILED(hr))
	{
		return hr;
	}

	// 初期パラメータの設定
	{
		m_move = inParam[PARAM_SNOW_MOVE];
	}

	return S_OK;
}

//---------------------------------------------------
// 終了処理
//---------------------------------------------------
void Snow2D::uninit()
{
	// 親クラスの処理
	GameObject2D::uninit();
}

//---------------------------------------------------
// 更新処理
//---------------------------------------------------
void Snow2D::update()
{
	// 位置の更新
	setPos(getPos() + m_move);
	if (getPos().y >= SCREEN_HEIGHT)
	{
		setIsDestroy(true);
	}

	// 親クラスの処理
	GameObject2D::update();
}

//---------------------------------------------------
// 描画処理
//---------------------------------------------------
void Snow2D::draw() const
{
	// 親クラスの処理
	GameObject2D::draw();
}

//---------------------------------------------------
// インスペクター
//---------------------------------------------------
void Snow2D::inspector()
{
	// 親クラスの処理
	GameObject2D::inspector();
}

//---------------------------------------------------
// 保存
//---------------------------------------------------
void Snow2D::save(json& outObject) const
{
	// 親クラスの処理
	GameObject2D::save(outObject);

	outObject[PARAM_SNOW_MOVE] = m_move;
}
