//--------------------------------------------------------------------------------
// 
// クリティカルセクション [critical_section.cpp]
// Author: Taito Jin
// 
//--------------------------------------------------------------------------------

//---------------------------------------------------
// インクルード
//---------------------------------------------------
// system
#include "system/critical_section.h"

//---------------------------------------------------
// コンストラクタ
//---------------------------------------------------
CriticalSection::CriticalSection()
{
	// クリティカルセクションの初期化
	InitializeCriticalSection(&m_cs);
}

//---------------------------------------------------
// デストラクタ
//---------------------------------------------------
CriticalSection::~CriticalSection()
{
	// クリティカルセクションの破棄
	DeleteCriticalSection(&m_cs);
}
