//--------------------------------------------------------------------------------
// 
// クリティカルセクション [critical_section.h]
// Author: Taito Jin
// 
//--------------------------------------------------------------------------------
#pragma once

//===================================================
// クリティカルセクションのクラス
//===================================================
class CriticalSection
{
public:
	//---------------------------------------------------
	// public メンバ関数宣言
	//---------------------------------------------------
	CriticalSection();	// コンストラクタ
	~CriticalSection();	// デストラクタ

	void lock() { EnterCriticalSection(&m_cs); }	// クリティカルセクションに入る
	void unlock() { LeaveCriticalSection(&m_cs); }	// クリティカルセクションを離れる

private:
	//---------------------------------------------------
	// private メンバ関数宣言
	//---------------------------------------------------
	CriticalSection(const CriticalSection&) = delete;
	void operator=(const CriticalSection&) = delete;

	//---------------------------------------------------
	// private メンバ変数宣言
	//---------------------------------------------------
	mutable CRITICAL_SECTION m_cs;	// スレッド同期用クリティカルセクション ( MEMO: draw などでも使用するかもなので mutable )
};
